  # 日付っぽい文字列の正規表現を返す関数
  # 04_13_date-date-ish-fun.R
date_ish <- function(){
  era <- "([MTSHRＭＴＳＨＲ]|明治|大正|昭和|平成|令和)?"
  yr <- "[\\d元]{0,4}[-－.．_＿/／年]?"
  mn <- "\\d{1,2}[-－.．_＿/／月]"
  dy <- "\\d{1,2}日?"
  dw <- "([\\(（][月火水木金土日祝]+[\\)）])?"
  p_1 <- paste0(era, yr, mn, dy, dw)
  p_2 <- paste0("((0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01]))", dw)
  p_3 <- paste0("([0-9]{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01]))", dw)
  p_4 <- paste0("((19|20)[0-9]{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01]))", dw)
  pattern <- paste(p_1, p_2, p_3, p_4, sep = "|")
  return(pattern)
}

