  # 日付っぽい文字列の正規表現を返す関数
  # 06_06_date-date-ish-fun.R
date_ish <- function(){
  era <- "([MTSHRＭＴＳＨＲ]|明治|大正|昭和|平成|令和)?" # 元号
  yr <- "[\\d元]{0,4}[-－.．_＿/／年]?"                  # 年(区切り非必須)
  mn <- "\\d{1,2}[-－.．_＿/／月]"                       # 月(区切り必須)
  dy <- "\\d{1,2}日?"                                    # 日(区切り非必須)
  dw <- "([\\(（][月火水木金土日祝]+[\\)）])?"           # 曜日(非必須)
  mn_dy <- "(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])"     # 月日
  yr_4 <-  "(19|20)?[0-9]{2}"                            # 2桁か4桁の年
  p_1 <- paste0(era, yr, mn, dy, dw)
  p_2 <- paste0(      mn_dy)                             # 数字のみの月日
  p_3 <- paste0(yr_4, mn_dy)                             # 数字のみの年月日
  pattern <- paste(p_1, p_2, p_3, sep = "|")
  return(pattern)
}

